Revit 2024 API
StructuralAssetClass Enumeration
 Represents the type of material described by a structural asset. This enum value is returned by Autodesk::Revit::DB::StructuralAsset::StructuralAssetClass.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Since: 2013
Syntax
C#
public enum StructuralAssetClass
Visual Basic
Public Enumeration StructuralAssetClass
Visual C++
public enum class StructuralAssetClass
Members
Member name | Description
Undefined |  Structural asset class is undefined.
Basic |  Structural asset class is basic.
Generic |  Structural asset class is generic.
Metal |  Structural asset class is metal.
Concrete |  Structural asset class is concrete.
Wood |  Structural asset class is wood.
Liquid |  Structural asset class is liquid.
Gas |  Structural asset class is gas.
Plastic |  Structural asset class is plastic.
See Also
Autodesk.Revit.DB Namespace